app/Models/MyModel.php

SELECT *
FROM `products`
WHERE `id` = '3'
SELECT *
FROM `products`
---
    public function getData($id = false) {
        if($id) {
            return $this->db->table('products')->where('id',$id)->get()->getResult();
        } else {
            return $this->db->table('products')->get()->getResult();

INSERT INTO `products` (`product`, `category`, `qty`, `price`, `image`) VALUES ('produk 8', 'elektronik', '9', '1000000', 'lg-monitor_4.jpg')
---
    public function insertData($fileName) {
        $data = array(
            'product'=>$this->input->getPost('product'),
            'category'=>$this->input->getPost('category'),
            'qty'=>$this->input->getPost('qty'),
            'price'=>$this->input->getPost('price'),
            'image'=>$fileName
        );
        $this->db->table('products')->insert($data);

SELECT *
FROM `products`
WHERE `id` = '1'
DELETE FROM `products`
WHERE `id` = '3'
---
    public function deleteData() {
        $id = $this->input->getPost('deleteId');
        $productData = $this->getData($id);
        $imageFileName = $productData[0]->image;

        //delete image
        try{
            $this->deleteImage($imageFileName);
        } finally {
            $this->db->table('products')->where('id',$id)->delete();

UPDATE `products` SET `image` = 'lg-monitor_2.jpg'
WHERE `id` = '4'
---
    public function updateData() {
        $id = $this->input->getPost('editId');
        $updateData = array(
            'product'=>$this->input->getPost('newProduct'),
            'category'=>$this->input->getPost('newCategory'),
            'qty'=>$this->input->getPost('newQty'),
            'price'=>$this->input->getPost('newPrice')
        );
        $this->db->table('products')->where('id', $id)->update($updateData);